app/controllers/api/products_controller.rb

    def index
      respond_with Product.order(available_date: :DESC)
---
SELECT "products".* FROM "products" ORDER BY "products"."available_date" DESC

    def create
      respond_with :api, Product.create(product_params)
---
INSERT INTO "products" ("product_name", "available_date", "product_upc", "property_name", "property_value", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def destroy
      respond_with Product.destroy(params[:id])
---
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 7]]

    def update
      product = Product.find(params['id'])
---
SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]